Ran Plan for dir: `terraform/aks` workspace: `default`

<details><summary>Show Output</summary>

```diff
===== Plan Stage

module.public_ip.data.curl.big_data_cloud: Reading...
module.public_ip.data.curl.big_data_cloud: Read complete after 0s [id=1751623200]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNGIwNzc5NS04ZGRiLTQ2MWEtYmJlZS0wMmY5ZTFiZjdiNDY7b2JqZWN0SWQ9NzNjZjhiOTAtY2NjZi00ZWFkLTljMDUtNjJhZjRiMjkxMGI5O3N1YnNjcmlwdGlvbklkPTE2MzExNjY3LWI1OTktNDczZi1iNGM2LTAxNTJiYWNlNzlhMDt0ZW5hbnRJZD01ODBhYzFiYi0wYjkyLTQ0MjktYmQzNS1iYWNjNGQyYjNjYmQ=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_disk_encryption_set.des will be created
+ resource "azurerm_disk_encryption_set" "des" {
      + auto_key_rotation_enabled = false
      + encryption_type           = "EncryptionAtRestWithCustomerKey"
      + id                        = (known after apply)
      + key_vault_key_id          = (known after apply)
      + key_vault_key_url         = (known after apply)
      + location                  = "polandcentral"
      + name                      = "des"
      + resource_group_name       = "rg-su-fix"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_key_vault.des_vault will be created
+ resource "azurerm_key_vault" "des_vault" {
      + access_policy                 = (known after apply)
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "polandcentral"
      + name                          = (known after apply)
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "rg-su-fix"
      + sku_name                      = "premium"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "580ac1bb-0b92-4429-bd35-bacc4d2b3cbd"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
          + ip_rules       = [
              + "168.62.242.139",
            ]
        }
    }

  # azurerm_key_vault_access_policy.current_user will be created
+ resource "azurerm_key_vault_access_policy" "current_user" {
      + id              = (known after apply)
      + key_permissions = [
          + "Get",
          + "Create",
          + "Delete",
          + "GetRotationPolicy",
          + "Recover",
        ]
      + key_vault_id    = (known after apply)
      + object_id       = "73cf8b90-cccf-4ead-9c05-62af4b2910b9"
      + tenant_id       = "580ac1bb-0b92-4429-bd35-bacc4d2b3cbd"
    }

  # azurerm_key_vault_access_policy.des will be created
+ resource "azurerm_key_vault_access_policy" "des" {
      + id              = (known after apply)
      + key_permissions = [
          + "Get",
          + "WrapKey",
          + "UnwrapKey",
        ]
      + key_vault_id    = (known after apply)
      + object_id       = (known after apply)
      + tenant_id       = (known after apply)
    }

  # azurerm_key_vault_key.des_key will be created
+ resource "azurerm_key_vault_key" "des_key" {
      + curve                   = (known after apply)
      + e                       = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_opts                = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size                = 2048
      + key_type                = "RSA-HSM"
      + key_vault_id            = (known after apply)
      + n                       = (known after apply)
      + name                    = "des-key"
      + public_key_openssh      = (known after apply)
      + public_key_pem          = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + x                       = (known after apply)
      + y                       = (known after apply)
    }

  # azurerm_resource_group.main[0] will be created
+ resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "polandcentral"
      + name     = "rg-su-fix"
    }

  # azurerm_subnet.this will be created
+ resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.52.0.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "snet-su-fix"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-su-fix"
      + virtual_network_name                          = "vnet-su-fix"
    }

  # azurerm_virtual_network.this will be created
+ resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.52.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "polandcentral"
      + name                           = "vnet-su-fix"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-su-fix"
      + subnet                         = (known after apply)
    }

  # random_id.name will be created
+ resource "random_id" "name" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_string.key_vault_prefix will be created
+ resource "random_string" "key_vault_prefix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = (known after apply)
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.aks.data.azurerm_client_config.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "this" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.aks.data.azurerm_resource_group.aks_rg[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "aks_rg" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "rg-su-fix"
      + tags       = (known after apply)
    }

  # module.aks.azapi_update_resource.aks_cluster_post_create will be created
+ resource "azapi_update_resource" "aks_cluster_post_create" {
      + body                    = {
          + properties = {
              + kubernetesVersion = "1.29"
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = (known after apply)
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + sensitive_body          = (write-only attribute)
      + type                    = "Microsoft.ContainerService/managedClusters@2024-02-01"
    }

  # module.aks.azurerm_kubernetes_cluster.main will be created
+ resource "azurerm_kubernetes_cluster" "main" {
      + automatic_upgrade_channel           = "patch"
      + azure_policy_enabled                = true
      + cost_analysis_enabled               = false
      + current_kubernetes_version          = (known after apply)
      + disk_encryption_set_id              = (known after apply)
      + dns_prefix                          = (known after apply)
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.29"
      + local_account_disabled              = false
      + location                            = "polandcentral"
      + name                                = (known after apply)
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = false
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "rg-su-fix"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = false

      + auto_scaler_profile (known after apply)

      + azure_active_directory_role_based_access_control {
          + tenant_id = "580ac1bb-0b92-4429-bd35-bacc4d2b3cbd"
        }

      + default_node_pool {
          + auto_scaling_enabled    = true
          + host_encryption_enabled = true
          + kubelet_disk_type       = (known after apply)
          + max_count               = 2
          + max_pods                = 100
          + min_count               = 1
          + name                    = "testnodepool"
          + node_count              = (known after apply)
          + node_labels             = {
              + "node1" = "label1"
            }
          + node_public_ip_enabled  = false
          + orchestrator_version    = (known after apply)
          + os_disk_size_gb         = 60
          + os_disk_type            = "Managed"
          + os_sku                  = (known after apply)
          + scale_down_mode         = "Delete"
          + tags                    = {
              + "Agent" = "agentTag"
            }
          + type                    = "VirtualMachineScaleSets"
          + ultra_ssd_enabled       = false
          + vm_size                 = "Standard_D2s_v3"
          + vnet_subnet_id          = (known after apply)
          + workload_runtime        = (known after apply)
          + zones                   = [
              + "1",
              + "2",
            ]

          + linux_os_config {
              + transparent_huge_page_enabled = "always"

              + sysctl_config {
                  + fs_aio_max_nr               = 65536
                  + fs_file_max                 = 100000
                  + fs_inotify_max_user_watches = 1000000
                }
            }

          + upgrade_settings {
              + max_surge                     = "10%"
              + node_soak_duration_in_minutes = 0
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (sensitive value)
        }

      + ingress_application_gateway {
          + effective_gateway_id                 = (known after apply)
          + gateway_name                         = "agw-su-fix"
          + ingress_application_gateway_identity = (known after apply)
          + subnet_cidr                          = "10.52.1.0/24"
        }

      + kubelet_identity (known after apply)

      + maintenance_window {
          + allowed {
              + day   = "Friday"
              + hours = [
                  + 21,
                  + 22,
                  + 23,
                ]
            }
          + not_allowed {
              + end   = "2035-01-01T21:00:00Z"
              + start = "2035-01-01T20:00:00Z"
            }
        }

      + maintenance_window_node_os {
          + duration   = 16
          + frequency  = "Daily"
          + interval   = 1
          + start_date = (known after apply)
          + start_time = "07:00"
          + utc_offset = "+01:00"
        }

      + network_profile {
          + dns_service_ip      = "10.0.0.10"
          + ip_versions         = (known after apply)
          + load_balancer_sku   = "standard"
          + network_data_plane  = "azure"
          + network_mode        = (known after apply)
          + network_plugin      = "azure"
          + network_plugin_mode = "overlay"
          + network_policy      = "calico"
          + outbound_type       = "loadBalancer"
          + pod_cidr            = (known after apply)
          + pod_cidrs           = (known after apply)
          + service_cidr        = "10.0.0.0/16"
          + service_cidrs       = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)
    }

  # module.aks.azurerm_role_assignment.application_gateway_byo_vnet_network_contributor[0] will be created
+ resource "azurerm_role_assignment" "application_gateway_byo_vnet_network_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_role_assignment.application_gateway_resource_group_reader[0] will be created
+ resource "azurerm_role_assignment" "application_gateway_resource_group_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.null_resource.kubernetes_cluster_name_keeper will be created
+ resource "null_resource" "kubernetes_cluster_name_keeper" {
      + id       = (known after apply)
      + triggers = {
          + "name" = (known after apply)
        }
    }

  # module.aks.null_resource.kubernetes_version_keeper will be created
+ resource "null_resource" "kubernetes_version_keeper" {
      + id       = (known after apply)
      + triggers = {
          + "version" = "1.29"
        }
    }

  # module.aks.time_sleep.interval_before_cluster_update[0] will be created
+ resource "time_sleep" "interval_before_cluster_update" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.naming.random_string.first_letter will be created
+ resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = (known after apply)
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.naming.random_string.main will be created
+ resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ test_admin_client_certificate     = (sensitive value)
+ test_admin_client_key             = (sensitive value)
+ test_admin_cluster_ca_certificate = (sensitive value)
+ test_admin_host                   = (sensitive value)
+ test_admin_password               = (sensitive value)
+ test_admin_username               = (sensitive value)
+ test_aks_id                       = (known after apply)
+ test_client_certificate           = (sensitive value)
+ test_client_key                   = (sensitive value)
+ test_cluster_ca_certificate       = (sensitive value)
+ test_cluster_portal_fqdn          = (known after apply)
+ test_host                         = (sensitive value)
+ test_kube_raw                     = (sensitive value)
+ test_password                     = (sensitive value)
+ test_username                     = (sensitive value)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terraform/aks
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://227f9c26051a:4141/lock?id=andrey-parkhomets%252Fgitops%252Fterraform%252Faks%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terraform/aks
  ```
Plan: 19 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```